yanxw1980/stm32f103zet6/BSP/BSP.h
/*
*********************************************************************************************************
*                                     MICIRUM BOARD SUPPORT PACKAGE
*
*                             (c) Copyright 2013; Micrium, Inc.; Weston, FL
*
*               All rights reserved.  Protected by international copyright laws.
*               Knowledge of the source code may NOT be used to develop a similar product.
*               Please help us continue to provide the Embedded community with the finest
*               software available.  Your honesty is greatly appreciated.
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*
*                                        BOARD SUPPORT PACKAGE
*
*                                     ST Microelectronics STM32
*                                              on the
*
*                                     Micrium uC-Eval-STM32F107
*                                        Evaluation Board
*
* Filename      : bsp.h
* Version       : V1.00
* Programmer(s) : EHS
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                                 MODULE
*
* Note(s) : (1) This header file is protected from multiple pre-processor inclusion through use of the
*               BSP present pre-processor macro definition.
*********************************************************************************************************
*/

#ifndef  BSP_PRESENT
#define  BSP_PRESENT


/*
*********************************************************************************************************
*                                                 EXTERNS
*********************************************************************************************************
*/

#ifdef   BSP_MODULE
#define  BSP_EXT
#else
#define  BSP_EXT  extern
#endif


/*
*********************************************************************************************************
*                                              INCLUDE FILES
*********************************************************************************************************
*/

#include  <stdarg.h>
#include  <stdio.h>

#include  <cpu.h>
#include  <cpu_core.h>

#include  <lib_ascii.h>
#include  <lib_def.h>
#include  <lib_mem.h>
#include  <lib_str.h>

//#include  <stm32f10x_lib.h>
#include  <stm32f10x_conf.h>

#include  <app_cfg.h>

#include  <bsp_os.h>
#include  <bsp_ser.h>
//#include  <bsp_i2c.h>
//#include  <bsp_stlm75.h>
#include  <MotorBsp.h>

//#define  PR_MODBUS	
#undef  PR_MODBUS

/*
*********************************************************************************************************
*                                          GPIO PIN DEFINITIONS
*********************************************************************************************************
*/

/* -------------------- GPIOA PINS -------------------- */
#define  BSP_GPIOA_MII_CRS                       DEF_BIT_00
#define  BSP_GPIOA_MII_RX_CLK                    DEF_BIT_01
#define  BSP_GPIOA_MII_MDIO                      DEF_BIT_02
#define  BSP_GPIOA_MII_COL                       DEF_BIT_03
#define  BSP_GPIOA_PIN_04                        DEF_BIT_04
#define  BSP_GPIOA_SPI1_SCK                      DEF_BIT_05
#define  BSP_GPIOA_SPI1_MISO                     DEF_BIT_06
#define  BSP_GPIOA_SPI1_MOSI                     DEF_BIT_07
//#define  BSP_GPIOA_LED2                          DEF_BIT_08
#define  BSP_GPIOA_USB_VBUS                      DEF_BIT_09
#define  BSP_GPIOA_USB_ID                        DEF_BIT_10
#define  BSP_GPIOA_USB_DM                        DEF_BIT_11
#define  BSP_GPIOA_USB_DP                        DEF_BIT_12
#define  BSP_GPIOA_TMS_SWDIO                     DEF_BIT_13
#define  BSP_GPIOA_TCK_SWCLK                     DEF_BIT_14
#define  BSP_GPIOA_TDI                           DEF_BIT_15


                                                                /* -------------------- GPIOB PINS -------------------- */
#define  BSP_GPIOB_LED1                          DEF_BIT_05
//#define  BSP_GPIOB_PIN_01                        DEF_BIT_01
#define  BSP_GPIOB_PIN_02                        DEF_BIT_02
#define  BSP_GPIOB_TDO_SWO                       DEF_BIT_03
#define  BSP_GPIOB_TRST                          DEF_BIT_04
#define  BSP_GPIOB_I2C_SMB                       DEF_BIT_05
#define  BSP_GPIOB_I2C1_SCK                      DEF_BIT_06
#define  BSP_GPIOB_I2C1_DATA                     DEF_BIT_07
#define  BSP_GPIOB_MII_TXD3                      DEF_BIT_08
#define  BSP_GPIOB_PIN_09                        DEF_BIT_09
#define  BSP_GPIOB_MII_RX_ERR                    DEF_BIT_10
#define  BSP_GPIOB_MII_TX_ERR                    DEF_BIT_11
#define  BSP_GPIOB_MII_TXD0                      DEF_BIT_12
#define  BSP_GPIOB_MII_TXD1                      DEF_BIT_13
#define  BSP_GPIOB_PIN_14                        DEF_BIT_14
#define  BSP_GPIOB_PIN_15                        DEF_BIT_15

#define  BSP_GPIOB_PIN_01                        DEF_BIT_05


                                                                /* -------------------- GPIOC PINS -------------------- */
#define  BSP_GPIOC_PIN_00                        DEF_BIT_00
#define  BSP_GPIOC_MII_MDC                       DEF_BIT_01
#define  BSP_GPIOC_MII_TXD2                      DEF_BIT_02
#define  BSP_GPIOC_MII_TX_CLK                    DEF_BIT_03
#define  BSP_GPIOC_PIN_04                        DEF_BIT_04
#define  BSP_GPIOC_PIN_05                        DEF_BIT_05
#define  BSP_GPIOC_PIN_06                        DEF_BIT_06
#define  BSP_GPIOC_PIN_07                        DEF_BIT_07
#define  BSP_GPIOC_PIN_08                        DEF_BIT_08
#define  BSP_GPIOC_PIN_09                        DEF_BIT_09
#define  BSP_GPIOC_PIN_10                        DEF_BIT_10
#define  BSP_GPIOC_PIN_11                        DEF_BIT_11
#define  BSP_GPIOC_PIN_12                        DEF_BIT_12
#define  BSP_GPIOC_PIN_13                        DEF_BIT_13


                                                                /* -------------------- GPIOD PINS -------------------- */
#define  BSP_GPIOD_CAN1_RX                       DEF_BIT_00
#define  BSP_GPIOD_CAN1_TX                       DEF_BIT_01
#define  BSP_GPIOD_PIN_02                        DEF_BIT_02
#define  BSP_GPIOD_USART2_CTS                    DEF_BIT_03
#define  BSP_GPIOD_USART2_RTS                    DEF_BIT_04
#define  BSP_GPIOD_USART2_TX                     DEF_BIT_05
#define  BSP_GPIOD_USART2_RX                     DEF_BIT_06
#define  BSP_GPIOD_PIN_07                        DEF_BIT_07
#define  BSP_GPIOD_MII_RX_DV                     DEF_BIT_08
#define  BSP_GPIOD_MII_RXD0                      DEF_BIT_09
#define  BSP_GPIOD_MII_RXD1                      DEF_BIT_10
#define  BSP_GPIOD_MII_RXD2                      DEF_BIT_11
#define  BSP_GPIOD_MII_RXD3                      DEF_BIT_12
#define  BSP_GPIOD_LED1                          DEF_BIT_13
#define  BSP_GPIOD_LED2                          DEF_BIT_14
#define  BSP_GPIOD_LED3                          DEF_BIT_15



                                                                /* -------------------- GPIOE PINS -------------------- */
#define  BSP_GPIOE_PIN_00                        DEF_BIT_00
#define  BSP_GPIOE_USB_PWR_SW_ON                 DEF_BIT_01
#define  BSP_GPIOE_PIN_02                        DEF_BIT_02
#define  BSP_GPIOE_PIN_03                        DEF_BIT_03
#define  BSP_GPIOE_PIN_04                        DEF_BIT_04
#define  BSP_GPIOE_MII_INT                       DEF_BIT_05
#define  BSP_GPIOE_SD_CARD_DETECT                DEF_BIT_06
#define  BSP_GPIOE_PIN_07                        DEF_BIT_07
#define  BSP_GPIOE_PIN_08                        DEF_BIT_08
#define  BSP_GPIOE_PIN_09                        DEF_BIT_09
#define  BSP_GPIOE_PIN_10                        DEF_BIT_10
#define  BSP_GPIOE_PIN_11                        DEF_BIT_11
#define  BSP_GPIOE_PIN_12                        DEF_BIT_12
#define  BSP_GPIOE_PIN_13                        DEF_BIT_13
#define  BSP_GPIOE_PIN_14                        DEF_BIT_14
#define  BSP_GPIOE_PIN_15                        DEF_BIT_15

