yanxw1980/stm32f103zet6/BSP/BSP.h
/*
*********************************************************************************************************
*                                     PERIPHERAL POWER/CLOCK SERVICES
*********************************************************************************************************
*/

CPU_INT32U   BSP_PeriphClkFreqGet        (CPU_DATA       pwr_clk_id);

void         BSP_PeriphEn                (CPU_DATA       pwr_clk_id);

void         BSP_PeriphDis               (CPU_DATA       pwr_clk_id);


/*
*********************************************************************************************************
*                                              LED SERVICES
*********************************************************************************************************
*/

void         BSP_LED_On                  (CPU_INT08U     led);

void         BSP_LED_Off                 (CPU_INT08U     led);

void         BSP_LED_Toggle              (CPU_INT08U     led);

/*
*********************************************************************************************************
*                                              UART
*********************************************************************************************************
*/
// 串口端口定义
#define IO_PIN_UART1_RXD                 GPIO_Pin_10
#define IO_PORT_UART1_RXD                GPIOA
#define IO_CLK_UART1_RXD                 RCC_APB2Periph_GPIOA  
#define IO_PIN_UART1_TXD                 GPIO_Pin_9
#define IO_PORT_UART1_TXD                GPIOA
#define IO_CLK_UART1_TXD                 RCC_APB2Periph_GPIOA  

#define IO_PIN_UART2_RXD                 GPIO_Pin_3
#define IO_PORT_UART2_RXD                GPIOA
#define IO_CLK_UART2_RXD                 RCC_APB2Periph_GPIOA  
#define IO_PIN_UART2_TXD                 GPIO_Pin_2
#define IO_PORT_UART2_TXD                GPIOA
#define IO_CLK_UART2_TXD                 RCC_APB2Periph_GPIOA  

#define IO_PIN_UART3_RXD                 GPIO_Pin_11
#define IO_PORT_UART3_RXD                GPIOB
#define IO_CLK_UART3_RXD                 RCC_APB2Periph_GPIOB  
#define IO_PIN_UART3_TXD                 GPIO_Pin_10
#define IO_PORT_UART3_TXD                GPIOB
#define IO_CLK_UART3_TXD                 RCC_APB2Periph_GPIOB  

#define IO_PIN_UART4_RXD                 GPIO_Pin_11
#define IO_PORT_UART4_RXD                GPIOC
#define IO_CLK_UART4_RXD                 RCC_APB2Periph_GPIOC  
#define IO_PIN_UART4_TXD                 GPIO_Pin_10
#define IO_PORT_UART4_TXD                GPIOC
#define IO_CLK_UART4_TXD                 RCC_APB2Periph_GPIOC 


// 串口中断,时钟和优先级配置
#define UART1_BAUD                       115200
#define UART1_PRIO                       NVIC_PriorityGroup_0
#define UART1_CLK                        RCC_APB2Periph_USART1

#define UART2_BAUD                       19200
#define UART2_PRIO                       NVIC_PriorityGroup_1
#define UART2_CLK                        RCC_APB1Periph_USART2

#define UART3_BAUD                       9600
#define UART3_PRIO                       NVIC_PriorityGroup_2
#define UART3_CLK                        RCC_APB1Periph_USART3

#define UART4_BAUD                       115200
#define UART4_PRIO                       NVIC_PriorityGroup_3
#define UART4_CLK                        RCC_APB1Periph_UART4

// 串口中断,时钟和优先级配置
__packed
typedef struct
{	
	USART_TypeDef *pMode;
	uint8_t  bWork;
	uint32_t Baud;
	uint32_t Prio;
	uint32_t IRQn;
	uint32_t CLKI;
	CPU_DATA PERIPH_ID;
}UART_CONFIG, *P_UART_CONFIG;

// Uart index configuration
typedef enum 
{
  	nUART_1      = 0,    
	nUART_2         ,
	nUART_3         ,    
	nUART_4         ,
	nUART_M         ,

	UART_PC      = nUART_4,          // 主通信串口	
	UART_RV      = nUART_2,
	UART_SYR     = nUART_3,
	UART_DEBUG   = nUART_1,          // 调试串口
} Uart_TypeDef;

//__packed
typedef struct
{	
	BSP_OS_SEM TxWait;
	BSP_OS_SEM RxWait;
	BSP_OS_SEM Lock;
	CPU_INT08U RxData;
}UART_SEM, *P_UART_SEM;

/*
*********************************************************************************************************
*                                             MODULE END
*********************************************************************************************************
*/


#endif                                                          /* End of module include.                               */

extern OS_Q     MsgQueue[TASK_MSG_MAX];   
extern TASK_MSG stMsgHandle[TASK_MSG_MAX];

